#include <iostream>
#include "apartment.h"

int main()
{
	// Room r;
	// std::cin >> r;
	// std::cout << r;
	//
	// std::cout << std::endl;

	Apartment apt;
	std::cin >> apt;
	std::cout << apt;

	
	return 0;
}

/*Да се реализира клас Room, който описва помещение с площ в кв. м. (дробно число) и описание (низ с дължина до 30 символа). Да се реализира клас Apartment, който описва апартамент с произволен брой помещения. За двата класа да се реализират:

подходящи конструктори и "голяма четворка", ако е нужна
подходящи селектори и мутатори
операция >> за въвеждане от стандартния вход
операция << за извеждане на стандартния изход
Допълнително, за класът Apartment да се реализират следните функционалности:

метод, който намира общата площ на апартамент
операция [], която връща стая в апартамент по зададено описание
операции за сравнение (<, <=, ==, >=, >), които сравняват два апартамента по "просторност", като за по-просторен се счита този апартамент, за който средната площ на стая е по-голяма*/